In [33]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [34]:
df = pd.read_excel("selary.xlsx")

In [35]:
df

   NO.     Name   Selary
0    1  Al imran   15000
1    2     sifat   10000
2    3     ridoy    8000
3    4     mita     6000
4    5     mihir    4000
5    6    mahadi    2000

In [45]:
df.head()

   NO.     Name   Selary
0    1  Al imran   15000
1    2     sifat   10000
2    3     ridoy    8000
3    4     mita     6000
4    5     mihir    4000

In [37]:
df.head(3)

   NO.     Name   Selary
0    1  Al imran   15000
1    2     sifat   10000
2    3     ridoy    8000

In [38]:
df.shape

(6, 3)

In [39]:
df.isnull().any

<bound method DataFrame.any of      NO.  Name   Selary
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False>

In [40]:
df.isnull().sum()

NO.       0
Name      0
Selary    0
dtype: int64

In [41]:
df1 = pd.read_excel("market.xlsx")

In [42]:
df1

   No.    Name  Price
0    1  sugger     80
1    2  potato     10
2    3    book    250
3    4    solt     20
4    5    rice     45
5    6     pen      5